app/controllers/users_controller.rb

UPDATE "users" SET "name" = 'Joe Barrow', "password_digest" = '$2a$10$CqASfGiQcJg6RXNlUDrrJuxLxTSzj3R6ucLJbU30N0aTTHKbr8BkC', "remember_token" = 'hxE2FuVOwDtrsh_Os2OyTw', "updated_at" = '2012-05-29 01:42:22.259101' WHERE "users"."id" = 1
---
  def update
    if @user.update_attributes(params[:user])